# -*- coding:utf-8 -*-

"""
@author:Yuan
@file:overall.py
@time:2018/3/30 9:23
"""

'''
每个社区
根据数据库中已有标签
为每个标签计算平均值
该社区各个标签的值做条形图

'''

import matplotlib
import numpy as np
from matplotlib import pyplot as plt


def statsPLOT(sqdict):
    # 可视化
    for k_sq, v_sq in sqdict.items():
        print(v_sq)
        plt.bar(range(len(v_sq[1])), v_sq[1], color='#778899', tick_label=v_sq[0])
        plt.show()


sqdict = {'金融街融汇': [np.array(['小区居民', '环境卫生', '供暖', '电梯', '物业服务', '车位', '环境美化', '治安', '路面', '路灯'],
                             dtype='<U4'), np.array([0.11, -0.37777778, 1.6, -0.06666667, -1.46666667,
                                                     -0.43333333, -0.6, -0.9, -0.775, -0.4])],
          '绿城百合北区': [np.array(['环境卫生', '环境美化', '物业服务', '小区居民', '房屋质量', '治安', '车位', '供暖', '电梯', '路面'],
                              dtype='<U4'), np.array([-0.16, 0.5, -0.6, -0.5, 0.1, -0.7, -1.1, -0.3, -0.2, -1.])],
          '中粮万科长阳半岛': [np.array(['供暖', '物业服务', '房屋质量', '环境卫生', '治安', '环境美化', '小区居民', '路灯', '车位', '路面'],
                                dtype='<U4'), np.array([-0.46666667, -0.63333333, -0.8, -0.48461538, -0.35,
                                                        0.25, -0.55, -1., -1.02, 0.])],
          '新城国际': [np.array(['环境卫生', '小区居民', '物业服务', '治安', '车位', '房屋质量', '路灯', '环境美化'],
                            dtype='<U4'), np.array([-1.16666667, -0.95, -1.21666667, -0.6, -0.83333333,
                                                    -1., -2., -0.5])]}
statsPLOT(sqdict)
